In [1]:
from database import Connection
from library import Library
from student import Student
import uuid
import pandas as pd
import numpy as np

In [2]:
c=Connection(user='',password='',account='',database='OOPS_SCHOOL',schema='SCHOOL')

Connection is successful

In [17]:
c.create_table('Private_table','ROLL_NO INT, FIRST_NAME VARCHAR, YEAR DATE')

Table Private_table is created

In [22]:
c.insert_value_in_table('Private_Table',ROLL_NO=1,FIRST_NAME='John',YEAR='2024-12-12')

Values are inserted in Private_Table

In [23]:
c.add_columns_to_table('Private_Table',{'LAST_NAME':'VARCHAR'})

Column 'LAST_NAME' added to table 'Private_Table' with data type 'VARCHAR'

In [18]:
def my_method(**kwargs):
    print(kwargs)
    print(type(kwargs))

In [21]:
my_method(ROLL_NO=1,FIRST_NAME='John',YEAR='2024-12-12',LAST_NAME='Cena',Class=10)

{'ROLL_NO': 1, 'FIRST_NAME': 'John', 'YEAR': '2024-12-12', 'LAST_NAME': 'Cena', 'Class': 10}
<class 'dict'>

In [3]:
#c.add_columns_to_table('BOOK_RETURN_HISTORY',{'LATE_FEES_AMOUNT':'INT'})

In [3]:
l=Library(connection=c)
s=Student(connection=c)

In [5]:
s.student_creation(50,'johnny','Bravo',8,'2014')

Values are inserted in STUDENT

In [6]:
s.get_all_student_issued_books()

,ISSUANCE_ID,STUDENT_ID,BOOK_ID,ISSUANCE_DATE,RETURN_DATE,LATE_FEES_AMOUNT
0,501,101,f76fbb04-392e-4095-9615-2e8baf6d1306,2024-06-14,2024-06-21,0
1,601,703,93653c49-c2d8-49b1-a03f-d1d0d3456cef,2024-06-14,2024-06-21,0
2,701,702,cada5dc8-0eeb-4686-a972-1efef41d5980,2024-06-01,2024-06-08,90

In [9]:
l.get_book_id_for_book_selection('Experiments')

[('The Story of My Experiments with Truth (સત્યના પ્રયોગો અથવા આત્મકથા)',
  '4e7e9807-cd2c-43ba-b8af-69e8044b569a')]

In [10]:
l.book_selection('4e7e9807-cd2c-43ba-b8af-69e8044b569a',102)

Book picked up successfully
Values are inserted in STUDENT_ISSUED_BOOKS
Book issuance recorded successfully

In [12]:
l.book_returned(702,'cada5dc8-0eeb-4686-a972-1efef41d5980',90)

Book returned successfully
Record moved to Book Return History table successfully
Student deleted from student issued books table successfully

In [13]:
l.get_book_id_for_book_selection('A Tale')

[('A Tale of Two Cities', '08aec4ba-5823-41c7-9fcd-ac8ace56413d'),
 ('Ben-Hur: A Tale of the Christ', 'f518f4f7-fe1e-4cf8-ae2a-584e78e700c6')]

In [14]:
l.book_selection('08aec4ba-5823-41c7-9fcd-ac8ace56413d',101)

Book picked up successfully
Values are inserted in STUDENT_ISSUED_BOOKS
Book issuance recorded successfully

In [15]:
s.get_all_student_issued_books()

,ISSUANCE_ID,STUDENT_ID,BOOK_ID,ISSUANCE_DATE,RETURN_DATE,LATE_FEES_AMOUNT
0,601,703,93653c49-c2d8-49b1-a03f-d1d0d3456cef,2024-06-14,2024-06-21,0
1,801,102,4e7e9807-cd2c-43ba-b8af-69e8044b569a,2024-06-17,2024-06-24,0
2,501,101,f76fbb04-392e-4095-9615-2e8baf6d1306,2024-06-03,2024-06-10,70
3,901,101,08aec4ba-5823-41c7-9fcd-ac8ace56413d,2024-06-03,2024-06-10,70

In [27]:
#l.get_book_id_for_book_selection('Loli')

[('Lolita', 'cada5dc8-0eeb-4686-a972-1efef41d5980')]

In [28]:
#l.book_selection(book_id='cada5dc8-0eeb-4686-a972-1efef41d5980', student_id= 702)

Book picked up successfully
Values are inserted in STUDENT_ISSUED_BOOKS
Book issuance recorded successfully

In [5]:
#l.get_student_name(student_id=1)

('Tom', 'ANDREW')

In [6]:
#l.get_book_name(book_id='1da6d1ae-5391-43fb-84ac-062850a0835c')

("Harry Potter and the Philosopher's Stone",)

In [3]:
#schema = 'RETURN_ID INT AUTOINCREMENT PRIMARY KEY,STUDENT_ID INT, BOOK_ID VARCHAR, BOOK_RETURN_DATE DATE'
#c.create_table(tablename='BOOK_RETURN_HISTORY',schema=schema)

Table BOOK_RETURN_HISTORY is created

In [9]:
#s.student_creation(ROLL_NO=2,FIRST_NAME= 'Danzel',LAST_NAME='Washington',STANDARD=6,STANDARD_YEAR='2010')

Values are inserted in STUDENT

In [13]:
#df1=pd.read_csv('best-selling-books.csv')
#df1.head(3)

,Book,Author(s),Original language,First published,Approximate sales in millions,Genre
0,A Tale of Two Cities,Charles Dickens,English,1859,200.0,Historical fiction
1,The Little Prince (Le Petit Prince),Antoine de Saint-Exupéry,French,1943,200.0,Novella
2,Harry Potter and the Philosopher's Stone,J. K. Rowling,English,1997,120.0,Fantasy

In [14]:
#df1_new=df1[['Book']]
#df1_new.columns = ['Book_Name']

In [ ]:
#df1_new['Quantity']=np.random.randint(1,13,size=len(df1_new))
#df1_new['Book_Id'] = [uuid.uuid4() for _ in range(len(df1_new))]
#df1_new['Book_Id'] = df1_new['Book_Id'].astype(str)

In [ ]:
#df1_new = df1_new.rename(columns={'Book_Name': 'BOOK_NAME', 'Quantity': 'BOOK_QUANTITY', 'Book_Id': 'BOOK_ID'})

In [ ]:
#schema = 'BOOK_NAME VARCHAR, BOOK_QUANTITY INT, BOOK_ID VARCHAR PRIMARY KEY'
#c.create_table(tablename = 'LIBRARY_BOOKS',schema= schema)

In [ ]:
#c.upload_csv_to_snowflake(dataframe= df1_new,tablename='LIBRARY_BOOKS')

In [10]:
#schema = 'ISSUANCE_ID INT AUTOINCREMENT PRIMARY KEY, STUDENT_ID INT, BOOK_ID VARCHAR, ISSUANCE_DATE DATE, RETURN_DATE DATE'
#c.create_table('STUDENT_ISSUED_BOOKS',schema = schema)

Table STUDENT_ISSUED_BOOKS is created

In [4]:
#schema='BOOK_ID VARCHAR, BOOK_NAME VARCHAR,TRANSACTION_DATE DATE, QUANTITY_AVAILABLE INT'
#c.create_table(tablename= 'BOOK_AVAILABILITY_STATUS',schema= schema)

Table BOOK_AVAILABILITY_STATUS is created

In [6]:
#schema='STUDENT_ID INT AUTOINCREMENT PRIMARY KEY,ROLL_NO INT, FIRST_NAME VARCHAR,LAST_NAME VARCHAR, STANDARD INT,STANDARD_YEAR VARCHAR'
#c.create_table(tablename= 'STUDENT',schema= schema)

Table STUDENT is created

In [12]:
#s.student_creation(19,'Michael','Ballack',9,'2014')

Values are inserted in STUDENT

In [ ]:
#schema ='ROLL_NO INT, STANDARD INT, STANDARD_YEAR VARCHAR,BOOK_NAME VARCHAR, BOOK_ID VARCHAR, ISSUE_DATE DATE, RETURN_DATE DATE'
#c.create_table(tablename= 'BOOK_TRANSACTIONS',schema = schema)

In [15]:
#c.create_book_status_table()

Initial data replicated successfully.

In [5]:
#l.book_returned(102,'746aa8b2-e959-4795-8190-73bdd1faa357',10)

Book returned successfully
Record moved to Book Return History table successfully
Student deleted from student issued books table successfully

In [5]:
#c.insert_value_in_table('BOOK_RETURN_HISTORY',STUDENT_ID=201,BOOK_ID='08aec4ba-5823-41c7-9fcd-ac8ace56413d',BOOK_RETURN_DATE='2024-06-05')

Values are inserted in BOOK_RETURN_HISTORY